blog/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    @comments = Comment.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["body", "LOL NICE"], ["created_at", "2015-03-28 17:56:13.826335"], ["updated_at", "2015-03-28 17:56:13.826335"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_comment
      @comment = Comment.find(params[:id])